; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 11192 1 1 3 4 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image0 - mode
	infrared2 - mode
	infrared1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
)
(:goal (and
	(have_image Star4 infrared2)
	(have_image Star5 infrared1)
	(have_image Star6 infrared1)
	(have_image Phenomenon7 infrared2)
	(have_image Star8 infrared1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 star8 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
3. (turn_to satellite0 groundstation3 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 star8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
6. (take_image satellite0 star8 instrument0 infrared1)
   added: (have_image star8 infrared1)
   goals met: 1 of 5
7. (turn_to satellite0 star6 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star6)
   goals met: 1 of 5
8. (take_image satellite0 star6 instrument0 infrared1)
   added: (have_image star6 infrared1)
   goals met: 2 of 5
9. (turn_to satellite0 star5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star5)
   goals met: 2 of 5
10. (take_image satellite0 star5 instrument0 infrared1)
   added: (have_image star5 infrared1)
   goals met: 3 of 5
11. (turn_to satellite0 star4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star4)
   goals met: 3 of 5
12. (take_image satellite0 star4 instrument0 infrared2)
   added: (have_image star4 infrared2)
   goals met: 4 of 5
13. (turn_to satellite0 phenomenon7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 5
14. (take_image satellite0 phenomenon7 instrument0 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 5 of 5
